app/controllers/line_items_controller.rb

  def index
    @line_items = LineItem.all
---
SELECT "line_items".* FROM "line_items"

  def show
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1

  def edit
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1

  def create
    #@line_item = LineItem.add(params[:line_item])
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    @line_item.product = product

    respond_to do |format|
      if @line_item.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2014-04-17 17:19:30.575000', '2014-04-17 17:19:30.575000')
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (16, '2014-04-22 20:14:31.398000', NULL, 1, 1, '2014-04-22 20:14:31.398000')
UPDATE "line_items" SET "quantity" = 3, "updated_at" = '2014-04-21 17:03:59.300000' WHERE "line_items"."id" = 8

  def update
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1

  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1
DELETE FROM "line_items" WHERE "line_items"."id" = 980190962